<a href="https://colab.research.google.com/github/psssnikhil/medium/blob/master/Pandas/Pandas_Complete_Mastery(A_Z).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
df=pd.read_csv('Automobile_data.csv')
#if file format is xlsx use pd.read_excel

In [0]:
#df.head()
df.head(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0

In [0]:
df.tail()   #gives the last 5 rows by default"

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

If dataframe has data which is doesnt contain columns names or if they are separated using a separator like '|' or ',' the pandas can able to handle such cases.

In [0]:
df2=pd.read_csv('Automobile_data_without_col.csv',sep="|",names=['company','body-style','wheel-base'])

In [0]:
df2.tail()

  company   body-style  wheel-base
1    audi        sedan        99.8
2    audi  convertible        99.4
3    audi        sedan        99.8
4    audi        wagon       105.8
5     bmw        sedan       101.2

In [0]:
df.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
index               61 non-null int64
company             61 non-null object
body-style          61 non-null object
wheel-base          61 non-null float64
length              61 non-null float64
engine-type         61 non-null object
num-of-cylinders    61 non-null object
horsepower          61 non-null int64
average-mileage     61 non-null int64
price               58 non-null float64
dtypes: float64(3), int64(3), object(4)
memory usage: 4.8+ KB

In [0]:
df.describe()

,index,wheel-base,length,horsepower,average-mileage,price
count,61.000000,61.000000,61.000000,61.000000,61.000000,58.000000
mean,40.885246,98.481967,173.098361,107.852459,25.803279,15387.000000
std,25.429706,6.679234,14.021846,53.524398,8.129821,11320.259841
min,0.000000,88.400000,141.100000,48.000000,13.000000,5151.000000
25%,18.000000,94.500000,159.100000,68.000000,19.000000,6808.500000
50%,39.000000,96.300000,171.200000,100.000000,25.000000,11095.000000
75%,61.000000,101.200000,177.300000,123.000000,31.000000,18120.500000
max,88.000000,120.900000,208.100000,288.000000,47.000000,45400.000000

In [0]:
##part 2

In [0]:
#slicing of Dataframe
df[1:4]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0

In [0]:
#Accessing the data with the index value
df.loc[1]

index                         1
company             alfa-romero
body-style          convertible
wheel-base                 88.6
length                    168.8
engine-type                dohc
num-of-cylinders           four
horsepower                  111
average-mileage              21
price                     16500
Name: 1, dtype: object

In [0]:
#Alternate method 
df.iloc[1]

index                         1
company             alfa-romero
body-style          convertible
wheel-base                 88.6
length                    168.8
engine-type                dohc
num-of-cylinders           four
horsepower                  111
average-mileage              21
price                     16500
Name: 1, dtype: object

In [0]:
##write the difference between loc and iloc.

In [0]:
#accessing data in specific column
df['company'].head()

0    alfa-romero
1    alfa-romero
2    alfa-romero
3           audi
4           audi
Name: company, dtype: object

In [0]:
#the above can be done using iloc as shown below (slicing )
df.iloc[0:5]['company']

0    alfa-romero
1    alfa-romero
2    alfa-romero
3           audi
4           audi
Name: company, dtype: object

In [0]:
df.loc[[1],['body-style','length']]

    body-style  length
1  convertible   168.8

In [0]:
#Setting the Index to company so loc can be perfectly understood.

In [0]:
df1=df.set_index('company')

In [0]:
df1.index.values #observe the output.there are many duplicates values .we will handle them getting only unique in the next steps.

array(['alfa-romero', 'alfa-romero', 'alfa-romero', 'audi', 'audi',
       'audi', 'audi', 'bmw', 'bmw', 'bmw', 'bmw', 'bmw', 'bmw',
       'chevrolet', 'chevrolet', 'chevrolet', 'dodge', 'dodge', 'honda',
       'honda', 'honda', 'isuzu', 'isuzu', 'isuzu', 'jaguar', 'jaguar',
       'jaguar', 'mazda', 'mazda', 'mazda', 'mazda', 'mazda',
       'mercedes-benz', 'mercedes-benz', 'mercedes-benz', 'mercedes-benz',
       'mitsubishi', 'mitsubishi', 'mitsubishi', 'mitsubishi', 'nissan',
       'nissan', 'nissan', 'nissan', 'nissan', 'porsche', 'porsche',
       'porsche', 'toyota', 'toyota', 'toyota', 'toyota', 'toyota',
       'toyota', 'toyota', 'volkswagen', 'volkswagen', 'volkswagen',
       'volkswagen', 'volvo', 'volvo'], dtype=object)

In [0]:
df1.head()

,index,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
company,,,,,,,,,
alfa-romero,0,convertible,88.6,168.8,dohc,four,111,21,13495.0
alfa-romero,1,convertible,88.6,168.8,dohc,four,111,21,16500.0
alfa-romero,2,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
audi,3,sedan,99.8,176.6,ohc,four,102,24,13950.0
audi,4,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [0]:
#The below code represents go to row containing alfa-romero and get all the given columns data accordingly

In [0]:
df1.loc[['alfa-romero'],['body-style','length']]

              body-style  length
company
alfa-romero  convertible   168.8
alfa-romero  convertible   168.8
alfa-romero    hatchback   171.2

In [0]:
#part3

In [0]:
cols=df.columns
print(cols)

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [0]:
#print all columns names in order
for i in cols:
    print(i)

index
company
body-style
wheel-base
length
engine-type
num-of-cylinders
horsepower
average-mileage
price

In [0]:
#let us eliminate or drop some columns using drop method(using head just to get the top 5 rows of the dataframe)
df.drop(['num-of-cylinders','average-mileage'],axis=1).head()

,index,company,body-style,wheel-base,length,engine-type,horsepower,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,111,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,111,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,154,16500.0
3,3,audi,sedan,99.8,176.6,ohc,102,13950.0
4,4,audi,sedan,99.4,176.6,ohc,115,17450.0

In [0]:
df['company'].unique()  #there you go.we got unique company names as promised above.

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mitsubishi',
       'nissan', 'porsche', 'toyota', 'volkswagen', 'volvo'], dtype=object)

In [0]:
#Gives the Number of unique values(n stands for number)
df['company'].nunique()

16

In [0]:
#this gives the count of different values in single column that is taken.
df['company'].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
mitsubishi       4
mercedes-benz    4
volkswagen       4
audi             4
porsche          3
honda            3
alfa-romero      3
jaguar           3
isuzu            3
chevrolet        3
dodge            2
volvo            2
Name: company, dtype: int64

In [0]:
#concat (note:in appending rows the names of the columns in tow dataframe must be same.else it will throw an error)
df3=df[3:8]
new_data=pd.concat([df,df3],axis=0)

In [0]:

df.info()   
print('#######')
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
index               61 non-null int64
company             61 non-null object
body-style          61 non-null object
wheel-base          61 non-null float64
length              61 non-null float64
engine-type         61 non-null object
num-of-cylinders    61 non-null object
horsepower          61 non-null int64
average-mileage     61 non-null int64
price               58 non-null float64
dtypes: float64(3), int64(3), object(4)
memory usage: 4.8+ KB
#######
<class 'pandas.core.frame.DataFrame'>
Int64Index: 66 entries, 0 to 7
Data columns (total 10 columns):
index               66 non-null int64
company             66 non-null object
body-style          66 non-null object
wheel-base          66 non-null float64
length              66 non-null float64
engine-type         66 non-null object
num-of-cylinders    66 non-null object
horsepower          66 non-null int64
average-mileage     66 non-null int64
price               63 non-null float64
dtypes: float64(3), int64(3), object(4)
memory usage: 5.7+ KB

In [0]:
df4=df3.rename(columns={'company':'brand'})
df4

,index,brand,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0

In [0]:
merged_df=df.merge(df4, how='left',left_on='company', right_on='brand')

In [0]:
merged_df.head()   #merged the dataframe on company and brand on the left(which takes keys from left dataframe ie df)
                    #_x and _y are attached as the names are same in both dataframes

,index_x,company,body-style_x,wheel-base_x,length_x,engine-type_x,num-of-cylinders_x,horsepower_x,average-mileage_x,price_x,index_y,brand,body-style_y,wheel-base_y,length_y,engine-type_y,num-of-cylinders_y,horsepower_y,average-mileage_y,price_y
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,3.0,audi,sedan,99.8,176.6,ohc,four,102.0,24.0,13950.0
4,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,4.0,audi,sedan,99.4,176.6,ohc,five,115.0,18.0,17450.0

In [0]:
df_joined=df.join(df2,how='left',lsuffix='--x',rsuffix='--y')

In [0]:
df_joined.head()

,index,company--x,body-style--x,wheel-base--x,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,company--y,body-style--y,wheel-base--y
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,alfa-romero,convertible,88.6
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,audi,sedan,99.8
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0,audi,convertible,99.4
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,audi,sedan,99.8
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,audi,wagon,105.8

In [0]:
#Groupby demonstrated in simplest way possible
grouped=df.groupby('company')
grouped
grouped1=df.groupby('body-style')

In [0]:
grouped.groups

{'alfa-romero': Int64Index([0, 1, 2], dtype='int64'),
 'audi': Int64Index([3, 4, 5, 6], dtype='int64'),
 'bmw': Int64Index([7, 8, 9, 10, 11, 12], dtype='int64'),
 'chevrolet': Int64Index([13, 14, 15], dtype='int64'),
 'dodge': Int64Index([16, 17], dtype='int64'),
 'honda': Int64Index([18, 19, 20], dtype='int64'),
 'isuzu': Int64Index([21, 22, 23], dtype='int64'),
 'jaguar': Int64Index([24, 25, 26], dtype='int64'),
 'mazda': Int64Index([27, 28, 29, 30, 31], dtype='int64'),
 'mercedes-benz': Int64Index([32, 33, 34, 35], dtype='int64'),
 'mitsubishi': Int64Index([36, 37, 38, 39], dtype='int64'),
 'nissan': Int64Index([40, 41, 42, 43, 44], dtype='int64'),
 'porsche': Int64Index([45, 46, 47], dtype='int64'),
 'toyota': Int64Index([48, 49, 50, 51, 52, 53, 54], dtype='int64'),
 'volkswagen': Int64Index([55, 56, 57, 58], dtype='int64'),
 'volvo': Int64Index([59, 60], dtype='int64')}

In [0]:
grouped1.groups

{'convertible': Int64Index([0, 1, 46], dtype='int64'),
 'hardtop': Int64Index([35, 45], dtype='int64'),
 'hatchback': Int64Index([2, 13, 14, 16, 17, 27, 28, 29, 30, 36, 37, 47, 48, 49, 50], dtype='int64'),
 'sedan': Int64Index([ 3,  4,  5,  7,  8,  9, 10, 11, 12, 15, 19, 20, 21, 22, 23, 24, 25,
             26, 31, 32, 34, 38, 39, 40, 41, 42, 44, 55, 56, 57, 58, 59],
            dtype='int64'),
 'wagon': Int64Index([6, 18, 33, 43, 51, 52, 53, 54, 60], dtype='int64')}

In [0]:
#Select a specific group
#By calling get_group with the name of the group, we can return the respective subset of the data.

grouped1.get_group('sedan').head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0

In [0]:
grouped1.size()

body-style
convertible     3
hardtop         2
hatchback      15
sedan          32
wagon           9
dtype: int64

In [0]:
#Inexample, we apply qcut to a column. qcut allocates the data equally into a fixed number of bins.
df.groupby(
  pd.qcut(x=df['horsepower'],q=3,labels=['low','mid','high'])).size()

#checkout the groupby pd.cut to allocate the data to bins of specified boundaries

horsepower
low     24
mid     17
high    20
dtype: int64

In [0]:
grouped['average-mileage'].mean()  ## we get average mileage of car belonging to different companies

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

In [0]:
#so this gives us overall aggregate of all the required data in required format that can be customized.
df.groupby('company').agg({ 
    'body-style':'size',
    'average-mileage':['sum','mean'],
    'price':['sum','mean']
})

##body-style ,average-mileage, price are the keys which are columns names and values are the functions that are being applied.

              body-style average-mileage                price
                    size             sum       mean       sum          mean
company
alfa-romero            3              61  20.333333   46495.0  15498.333333
audi                   4              80  20.000000   65570.0  16392.500000
bmw                    6             114  19.000000  163280.0  27213.333333
chevrolet              3             123  41.000000   18021.0   6007.000000
dodge                  2              62  31.000000   12606.0   6303.000000
honda                  3              79  26.333333   30585.0  10195.000000
isuzu                  3             100  33.333333    6785.0   6785.000000
jaguar                 3              43  14.333333  103800.0  34600.000000
mazda                  5             140  28.000000   48274.0   9654.800000
mercedes-benz          4              72  18.000000  140160.0  35040.000000
mitsubishi             4             118  29.500000   26756.0   6689.000000
nissan                 5             157  31.400000   41445.0   8289.000000
porsche                3              51  17.000000   71056.0  35528.000000
toyota                 7             201  28.714286   57518.0   8216.857143
volkswagen             4             127  31.750000   33740.0   8435.000000
volvo                  2              46  23.000000   26355.0  13177.500000

 Most Commonly used function for agg
'size': Counts the rows
'sum': Sums the column up
'mean'/'median': Mean/Median of the column
'max'/'min': Maximum/Minimum of the column
'idxmax'/'idxmin': Index of the maximum/minimum of the column. Getting the index of the minimal or maximal value is helpful for mapping other columns, i.e., what's the name of the company per sales rep with the biggest deal
pd.Series.nunique: Counts unique values. Note that, unlike the previous functions, this is an actual function and not a string.

In [0]:
#let us understand Map,Apply,ApplyMap
#1)using Map to see if mileage is good or not.(lambda function is applied to all the values in the average-milaege column)
df['good milege?']=df['average-mileage'].map(lambda mileage:'yes' if mileage>=22 else 'no')

In [0]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,good milege?
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,no
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,no
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0,no
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,yes
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,no

In [0]:
#2)using Apply function to the dataframe
#Let us convert the horse power(hp) to kW(kilo watts).1hp=0.745kW
def converttokW(x):
    out=x*0.745
    return out
    
df['horsepower(kW)']=df['horsepower'].apply(lambda x:converttokW(x))

In [0]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,good milege?,horsepower(kW)
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,no,82.695
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,no,82.695
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0,no,114.730
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,yes,75.990
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,no,85.675

In [0]:
#3)Using applyMap in the dataframe.it is mostly used to apply for all the elements in dataframe ie datatype of all elements are same

columns=['wheel-base','length','horsepower','average-mileage']
df_new=df[columns]

In [0]:
df_new.head()

   wheel-base  length  horsepower  average-mileage
0        88.6   168.8         111               21
1        88.6   168.8         111               21
2        94.5   171.2         154               19
3        99.8   176.6         102               24
4        99.4   176.6         115               18

In [0]:
df_new=df_new.applymap(lambda x:x*4)            #multiplying every element by 4.

In [0]:
df_new.head()

   wheel-base  length  horsepower  average-mileage
0       354.4   675.2         444               84
1       354.4   675.2         444               84
2       378.0   684.8         616               76
3       399.2   706.4         408               96
4       397.6   706.4         460               72

In [0]:
#tricks to be mastered.(MISC)
#1)assign '=' for two dataframes.
#2)advantages of using copy
#3)Filtering the data using conditions
   #->specifying select condition like if and else
   #->selecting specific dtypes 
   #->using value_counts() to get the specific stats 
#4)Replace specific value with NaN (replace '' with NaN etc..)  
#5)check for NaN values in the dataframe
#6)Replacingo r filling the NaN(with '0','mean',ffill method)
#7)In numerical dataframe get row total and columnn total



new_df=df3
new_df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0

In [0]:
new_df['horsepower(inKw)']=""
new_df['horsepower(inKw)']=new_df['horsepower'].apply(converttokW)

C:\ProgramData\Anaconda3\envs\py36\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\envs\py36\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [0]:
new_df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,horsepower(inKw)
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,75.990
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,85.675
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,81.950
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0,81.950
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0,75.245

In [0]:
df3.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,horsepower(inKw)
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,75.990
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,85.675
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,81.950
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0,81.950
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0,75.245

In [0]:
#Notice that the above two dataframe are same ie they are assigned equal.changes are reflected in both dataframes if changes in anyone.
#TO over come this problem use can use "COPY"
new_df=df3.copy()
new_df['horsepower_new(inKw)']=new_df['horsepower'].apply(converttokW)

In [0]:
new_df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,horsepower(inKw),horsepower_new(inKw)
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,75.990,75.990
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,85.675,85.675
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,81.950,81.950
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0,81.950,81.950
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0,75.245,75.245

In [0]:
df3.head()    #if observed the horsepower_new is not present in this as this has been copied and we worked on that copy without affecting the original dataframe

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,horsepower(inKw)
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,75.990
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,85.675
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,81.950
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0,81.950
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0,75.245

In [0]:
#Filter the dataframe using conditions
df_filtered=df[df['body-style']=='wagon']   ### here we filtered the datafranme to get

In [0]:
df_filtered.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,good milege?,horsepower(kW)
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0,no,81.950
18,27,honda,wagon,96.5,157.1,ohc,four,76,30,7295.0,yes,56.620
33,45,mercedes-benz,wagon,110.0,190.9,ohc,five,123,22,28248.0,yes,91.635
43,56,nissan,wagon,94.5,170.2,ohc,four,69,31,7349.0,yes,51.405
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0,yes,46.190

In [0]:
#TO know different types and count of data that is present in dataframe 
df.dtypes.value_counts()

object     5
float64    4
int64      3
dtype: int64

In [0]:
#to show the stats sorted by distinct values in the column 'company'
df['company'].value_counts().reset_index().sort_values(by='index')

            index  company
10    alfa-romero        3
7            audi        4
1             bmw        6
13      chevrolet        3
14          dodge        2
9           honda        3
12          isuzu        3
11         jaguar        3
2           mazda        5
5   mercedes-benz        4
4      mitsubishi        4
3          nissan        5
8         porsche        3
0          toyota        7
6      volkswagen        4
15          volvo        2

In [0]:
#A simpler way of the above is shown below
df['company'].value_counts().sort_index()

alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            3
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          3
toyota           7
volkswagen       4
volvo            2
Name: company, dtype: int64

In [0]:
#to filter dataframe to specific datatypes only
df_select=df.select_dtypes(include=['int64','float64'])
df_select.head()

,index,wheel-base,length,horsepower,average-mileage,price,horsepower(kW)
0,0,88.6,168.8,111,21,13495.0,82.695
1,1,88.6,168.8,111,21,16500.0,82.695
2,2,94.5,171.2,154,19,16500.0,114.730
3,3,99.8,176.6,102,24,13950.0,75.990
4,4,99.4,176.6,115,18,17450.0,85.675

In [0]:
#replace anyvalue with " " just to manipulate the data for the visualizing :-)\
#you can replace anyvalue with any using the below format
import numpy as np
df_replace=df_select.replace( {111:" ",102: " "})      # because 111 is in int format
#if the value to be replaced is string it needed to be in ' '(quotations).
#df_replace=df_select.replace( {'hi':" ",'hello': " "})

In [0]:
df_replace.head()     #Now you can see the Blank spaces in horsepower.this type of dataset is present in realtime scenarios.

   index wheel-base length horsepower  average-mileage  price horsepower(kW)
0      0       88.6  168.8                          21  13495         82.695
1      1       88.6  168.8                          21  16500         82.695
2      2       94.5  171.2        154               19  16500         114.73
3      3       99.8  176.6                          24  13950          75.99
4      4       99.4  176.6        115               18  17450         85.675

In [0]:
#check for the total 
df_new=df_replace.copy()
df_new = df_new.replace(r'^\s*$', np.NaN, regex=True)
df_new.head()

,index,wheel-base,length,horsepower,average-mileage,price,horsepower(kW)
0,0,88.6,168.8,NaN,21,13495.0,82.695
1,1,88.6,168.8,NaN,21,16500.0,82.695
2,2,94.5,171.2,154.0,19,16500.0,114.730
3,3,99.8,176.6,NaN,24,13950.0,75.990
4,4,99.4,176.6,115.0,18,17450.0,85.675

In [0]:
print(df_new.isnull().sum())   #so we have 1,3,3 null values in wheelbase,horsepower and price columns respectively.

index              0
wheel-base         1
length             0
horsepower         3
average-mileage    0
price              3
horsepower(kW)     0
dtype: int64

In [0]:
#Now you can either remove rows with NaN or you can replace those values with any value like 'zero' or "meanvalue" of the column according to your dataset.
df_new1=df_new.replace(np.nan,0)     #method 1 ie using numpy
df_new2=df_new.fillna(0)             #method 2 ie using pandas built in 
df_new3=df_new.copy()
df_new3['horsepower']=df_new['horsepower'].fillna(df_new['horsepower'].mean())
#note:You can also apply these methods just to specific columns of your choice
print(df_new1.head())
print('######')
print(df_new3.head())

   index  wheel-base  length  horsepower  average-mileage    price  \
0      0        88.6   168.8         0.0               21  13495.0
1      1        88.6   168.8         0.0               21  16500.0
2      2        94.5   171.2       154.0               19  16500.0
3      3        99.8   176.6         0.0               24  13950.0
4      4        99.4   176.6       115.0               18  17450.0

   horsepower(kW)
0          82.695
1          82.695
2         114.730
3          75.990
4          85.675
######
   index  wheel-base  length  horsepower  average-mileage    price  \
0      0        88.6   168.8  107.844828               21  13495.0
1      1        88.6   168.8  107.844828               21  16500.0
2      2        94.5   171.2  154.000000               19  16500.0
3      3        99.8   176.6  107.844828               24  13950.0
4      4        99.4   176.6  115.000000               18  17450.0

   horsepower(kW)
0          82.695
1          82.695
2         114.730
3          75.990
4          85.675

In [0]:
#you can also use ffill which forward fills the data ie take the previous value in the columns which is not empty
df_new4=df_new.fillna(method='ffill',inplace=True)
df_new.head()
#if you observe horsepower column the row with index 3 has hrose power of 154 which got replaced by using ffill which takes the previous value and fills it in.
#PS:observe that 1st row has horsepower NaN.so even 2nd row is also unaffected.

,index,wheel-base,length,horsepower,average-mileage,price,horsepower(kW)
0,0,88.6,168.8,NaN,21,13495.0,82.695
1,1,88.6,168.8,NaN,21,16500.0,82.695
2,2,94.5,171.2,154.0,19,16500.0,114.730
3,3,99.8,176.6,154.0,24,13950.0,75.990
4,4,99.4,176.6,115.0,18,17450.0,85.675

In [0]:
df_new1=df_new1.astype(int)     #taking df_new1 as NaN are replaced with '0'
df_new1['col_total']     = df_new1.apply(lambda x: x.sum(), axis=1)
df_new1.loc['row_total'] = df_new1.apply(lambda x: x.sum())

In [0]:
df_new1.head()    # we got row totals also which are not displayed here.remove head to see them.

,index,wheel-base,length,horsepower,average-mileage,price,horsepower(kW),col_total
0,0,88,168,0,21,13495,82,13854
1,1,88,168,0,21,16500,82,16860
2,2,94,171,154,19,16500,114,17054
3,3,99,176,0,24,13950,75,14327
4,4,99,176,115,18,17450,85,17947

In [0]:
df_new1['horsepower'] = df_new1['horsepower'].cumsum()
df_new1.head()

,index,wheel-base,length,horsepower,average-mileage,price,horsepower(kW),col_total
0,0,88,168,0,21,13495,82,13854
1,1,88,168,0,21,16500,82,16860
2,2,94,171,154,19,16500,114,17054
3,3,99,176,154,24,13950,75,14327
4,4,99,176,269,18,17450,85,17947

Hurray!!That's all for Now

Thankyou..
will keep on updating.
Connect at https://www.linkedin.com/in/nikhil-pentapalli-5744bb18b/